luisgarabo/KSDK_ESP8266/sources/freertos_main.c
/*
 * Copyright (c) 2015, Freescale Semiconductor, Inc.
 * Copyright 2016-2017 NXP
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * o Redistributions of source code must retain the above copyright notice, this list
 *   of conditions and the following disclaimer.
 *
 * o Redistributions in binary form must reproduce the above copyright notice, this
 *   list of conditions and the following disclaimer in the documentation and/or
 *   other materials provided with the distribution.
 *
 * o Neither the name of the copyright holder nor the names of its
 *   contributors may be used to endorse or promote products derived from this
 *   software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

/* FreeRTOS kernel includes. */
#include "FreeRTOS.h"
#include "task.h"
#include "queue.h"
#include "timers.h"

/* Freescale includes. */
#include "fsl_device_registers.h"
#include "fsl_debug_console.h"
#include "board.h"

#include "pin_mux.h"
#include "main.h"
/*******************************************************************************
 * Definitions
 ******************************************************************************/

ConfigTag_t ConfigInfo =
{
		.ReaderID = {0},
		.localIPaddress = {0},
		.DHCPEnable = 1,
		.SSID = {0},
		.PWD = {0},
		.ServerHostName = {0},
		.ServerIP = {0},
};

/* Task priorities. */
#define main_task_PRIORITY (configMAX_PRIORITIES - 1)
/*******************************************************************************
 * Prototypes
 ******************************************************************************/
static void main_task(void *pvParameters);

/*******************************************************************************
 * Code
 ******************************************************************************/
/*!
 * @brief Application entry point.
 */
int main(void)
{
    /* Init board hardware. */
    BOARD_InitPins();
    BOARD_BootClockRUN();
    BOARD_InitDebugConsole();

    //strcpy (ConfigInfo.SSID, "GaraboKings");
    //strcpy (ConfigInfo.PWD, "1126300158");

    strcpy (ConfigInfo.SSID, "External-Internet");
    strcpy (ConfigInfo.PWD, "1Freescale");

    configWiFi();

    xTaskCreate(main_task, "main_task", configMINIMAL_STACK_SIZE + 10, NULL, main_task_PRIORITY, NULL);
    vTaskStartScheduler();
    for (;;)
        ;
}

/*!
 * @brief Task responsible for printing of "Hello world." message.
 */
static void main_task(void *pvParameters)
{
	uint8_t receiveBuff;

    for (;;)
    {
        //PRINTF("Hello world.\r\n");
        //LPSCI_ReadBlocking(UART0, &receiveBuff, 1);
        //LPSCI_WriteBlocking(UART0, (uint8_t *)"AT", 2);
        //LPSCI_WriteBlocking(UART0, (uint8_t *)receiveBuff, 1);
        vTaskSuspend(NULL);
    }
}
